InformationRegisters/ИсторияЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяПолученияОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИВремяОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Сервер/Ext/Module.bsl
Функция ЗаписатьВРегистр(ТекстЗапроса, ВремяВыполнения, ВремяДо) Экспорт
	НоваяЗапись = РегистрыСведений.ИсторияЗапросов.СоздатьМенеджерЗаписи();
	НоваяЗапись.ТекстЗапроса = ТекстЗапроса;
	НоваяЗапись.ВремяПолученияОтвета = ВремяВыполнения;
	НоваяЗапись.ДатаИВремяОбращения = ВремяДо;
	НоваяЗапись.Записать(Истина);
КонецФункции
